app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM "events" ORDER BY startdate

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "title", "updated_at", "page", "description", "startdate") VALUES('2010-04-30 22:11:30', 'Summer Retreat - Yosemite!', '2010-04-30 22:11:30', 'This is our annual summer retreat! Come join us for fun in the sun!', 'Come join the fun!', '2010-08-27 12:30:00')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-04-30 23:48:47', "location" = 'Yosemite', "title" = 'Summer Retreat!' WHERE "id" = 1